Vulnerability Test Results/artillery-load-test.yml
config:
  target: "https://health-risk-management.onrender.com/api"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 100
      name: Baseline Load Phase (100 VUs)
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Health Check and Login Flow"
    flow:
      - get:
          url: "/health"
      - post:
          url: "/auth/login"
          json:
            email: "testpatient@vitalpredict.com"
            password: "Test@12345"
